## Option A:  
To get an annual end-of-year bonus for the next five years. The first installment would be $30,000 – to be paid in one year. In each of the following four years, the bonus payment would increase by 10%.

In [3]:
import math
import numpy as np
import pandas as pd
import random
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
eoy_bonuses = []
for i in range(5):
    eoy_bonuses.append(30000 * (1.1)**i)

In [5]:
eoy_bonuses

[30000.0, 33000.0, 36300.00000000001, 39930.000000000015, 43923.000000000015]

In [6]:
sum(eoy_bonuses)

183153.0

In [7]:
df_a = pd.DataFrame({"eoy_bonuses": eoy_bonuses})

In [11]:
df_a["year"] = [1,2,3,4,5]

Martin would be willing to work with the following assumptions. (1) He will definitely stay for five years with Renaissance; (2) He can borrow / lend money at an interest rate of 5% with his local bank; (3) The tax treatment of the three payment schedules is the same; and (4) Renaissance will not default within the next five years. In addition, he agrees with the analysts’ consensus forecasts of a stock price of $300 in five years.  

To simplify the decision process, Martin has decided to proceed step-by-step. That is, in a first step, he wants to make a decision between alternative (A), the annual bonus payment, and alternative (B), the big bonus payment in five years. Martin also desperately wants to buy a new car in one year which would cost $30,000. Martin is not quite sure how to factor this into the decision problem.

In [12]:
df_a["lend_out_rate"] = 0.05

In [13]:
df_a

   eoy_bonuses  year  lend_out_rate
0      30000.0     1           0.05
1      33000.0     2           0.05
2      36300.0     3           0.05
3      39930.0     4           0.05
4      43923.0     5           0.05

In [15]:
df_a["bank_earned"] = df_a.apply(lambda x : x.eoy_bonuses*(1.05)**(5-x.year), axis=1)

In [16]:
df_a

   eoy_bonuses  year  lend_out_rate  bank_earned
0      30000.0     1           0.05   36465.1875
1      33000.0     2           0.05   38201.6250
2      36300.0     3           0.05   40020.7500
3      39930.0     4           0.05   41926.5000
4      43923.0     5           0.05   43923.0000

In [17]:
df_a.sum()

eoy_bonuses      183153.0000
year                 15.0000
lend_out_rate         0.2500
bank_earned      200537.0625
dtype: float64

## Option B
To receive one big bonus payment in five years. In this case Renaissance has offered Martin a payment of $225,000 – to be paid in exactly five years from now.

In [18]:
# in simple scenario, looks like Option B still wins out

## More Complicated: Wants to buy a car for 30,000 in one year

In [19]:
# in option A, we can buy with cash

In [20]:
df_a_alt = df_a.copy()

In [25]:
del df_a_alt["bank_earned"]

In [26]:
df_a_alt["car"] = 0
df_a_alt.loc[0, "car"] = -30000
df_a_alt

   eoy_bonuses  year  lend_out_rate    car
0      30000.0     1           0.05 -30000
1      33000.0     2           0.05      0
2      36300.0     3           0.05      0
3      39930.0     4           0.05      0
4      43923.0     5           0.05      0

In [27]:
# now not available for bank investment earnings

In [29]:
df_a_alt["new_bank_earned"] = df_a_alt.apply(lambda x : (x.eoy_bonuses + x.car) * (1.05**(5-x.year)), axis=1)

In [30]:
df_a_alt

   eoy_bonuses  year  lend_out_rate    car  new_bank_earned
0      30000.0     1           0.05 -30000            0.000
1      33000.0     2           0.05      0        38201.625
2      36300.0     3           0.05      0        40020.750
3      39930.0     4           0.05      0        41926.500
4      43923.0     5           0.05      0        43923.000

In [31]:
df_a_alt.sum()

eoy_bonuses        183153.000
year                   15.000
lend_out_rate           0.250
car                -30000.000
new_bank_earned    164071.875
dtype: float64

### Option B with buying a car on loan

In [32]:
df_b_alt = pd.DataFrame({"car": [-30000, 0, 0, 0 ,0]})

In [34]:
30000 * 1.05**5

38288.44687500001

In [35]:
225000 - 38288.45

186711.55